# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:

* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [2]:
# Your code here
names = """ 
SELECT firstName, lastName
FROM employees
JOIN offices
USING(officeCode)
WHERE city = "Boston"
"""

df = pd.read_sql( names, conn)
print(df)

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [7]:
# Your code here
zero = """
SELECT officeCode, city, COUNT(employeeNumber) numberOfEmployees
FROM employees
LEFT JOIN offices
UNITY(officeCode)
GROUP BY officeCode, city
HAVING numberOfEmployees = 0
"""


df=pd.read_sql(zero, conn)

DatabaseError: Execution failed on sql '
SELECT officeCode, city, COUNT(employeeNumber) numberOfEmployees
FROM employees
LEFT JOIN offices
UNITY(officeCode)
GROUP BY officeCode, city
HAVING numberOfEmployees = 0
': near "(": syntax error

In [8]:
zero = """
SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS numberOfEmployees
FROM offices o
LEFT JOIN employees e ON o.officeCode = e.officeCode
GROUP BY o.officeCode, o.city
HAVING COUNT(e.employeeNumber) = 0
"""
df = pd.read_sql(zero, conn)

## Write 3 questions of your own and answer them

In [13]:
# Answers will vary

# Example question: 
# How many customers are there per office?

pd.read_sql(""" 
SELECT o.officeCode,  o.city, COUNT(c.customerNumber) AS numberOfCustomers
FROM offices o
JOIN employees e ON o.officeCode = e.officeCode
JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
GROUP BY o.officeCode, o.city
""", conn)

   officeCode           city  numberOfCustomers
0           1  San Francisco                 12
1           2         Boston                 12
2           3            NYC                 15
3           4          Paris                 29
4           5          Tokyo                  5
5           6         Sydney                 10
6           7         London                 17

In [14]:
"""
Question 1 List all customers located in the USA.
"""

# Your code here
customers = """
SELECT customerName, contactLastName, contactFirstName
FROM customers
WHERE country = "USA"
"""
pd.read_sql(customers, conn)

                    customerName contactLastName contactFirstName
0             Signal Gift Stores            King             Jean
1   Mini Gifts Distributors Ltd.          Nelson            Susan
2                Mini Wheels Co.          Murphy            Julie
3              Land of Toys Inc.             Lee             Kwai
4             Muscle Machine Inc           Young             Jeff
5          Diecast Classics Inc.           Leong           Kelvin
6           Technics Stores Inc.       Hashimoto             Juri
7         American Souvenirs Inc          Franco            Keith
8     Cambridge Collectables Co.           Tseng            Jerry
9                Gift Depot Inc.            King            Julie
10               Vitachrome Inc.           Frick          Michael
11       Auto-Moto Classics Inc.          Taylor           Leslie
12      Online Mini Collectables         Barajas           Miguel
13             Toys4GrownUps.com           Young            Julie
14             Boards & Toys Co.           Young             Mary
15  Collectable Mini Designs Co.        Thompson          Valarie
16          Marta's Replicas Co.       Hernandez            Marta
17                 Mini Classics           Frick            Steve
18           Mini Creations Ltd.           Huang             Wing
19      Corporate Gift Ideas Co.           Brown            Julie
20       Tekni Collectables Inc.           Brown          William
21       Classic Gift Ideas, Inc       Cervantes        Francisca
22    Men 'R' US Retailers, Ltd.        Chandler            Brian
23             Gifts4AllAges.com         Yoshido             Juri
24  Online Diecast Creations Co.           Young          Dorothy
25    Collectables For Less Inc.          Nelson            Allen
26          Classic Legends Inc.       Hernandez            Maria
27              Gift Ideas Corp.           Lewis              Dan
28     The Sharp Gifts Warehouse           Frick              Sue
29              Super Scale Inc.          Murphy           Leslie
30               Microscale Inc.            Choi               Yu
31              FunGiftIdeas.com         Benitez          Violeta
32   West Coast Collectables Co.        Thompson            Steve
33  Motor Mint Distributors Inc.         Salazar             Rosa
34      Signal Collectibles Ltd.          Taylor              Sue
35          Diecast Collectables          Franco          Valarie

In [16]:
"""
Question 2 Find the names and phone numbers of customers whose names start with 'T'.
"""

# Your code here
customers = """
SELECT customerName, phone PhoneNumber
FROM customers
WHERE customerName LIKE "T%"
"""

pd.read_sql(customers, conn)

                customerName      PhoneNumber
0       Technics Stores Inc.       6505556809
1       Toys of Finland, Co.      90-224 8555
2          Toys4GrownUps.com       6265557265
3    Toms Spezialitäten, Ltd     0221-5554327
4    Tekni Collectables Inc.       2015559350
5    Tokyo Collectables, Ltd  +81 3 3584 0555
6  The Sharp Gifts Warehouse       4085553659

In [ ]:
"""
Question : Find the names and phone numbers of customers whose names end with 'Inc'.
"""

# Your code here
customers = """
SELECT customerName, phone PhoneNumber
FROM customers
WHERE customerName LIKE "%Inc"
"""

pd.read_sql(customers, conn)

                 customerName       PhoneNumber
0          Muscle Machine Inc        2125557413
1      American Souvenirs Inc        2035557845
2  Down Under Souveniers, Inc    +64 9 312 5555
3     Classic Gift Ideas, Inc        2155554695
4      Lisboa Souveniers, Inc      (1) 354-2555
5    Feuer Online Stores, Inc       0342-555176
6          Raanan Stores, Inc  + 972 9 959 8555

In [19]:
"""
Question : Show all employees who are sales reps (jobTitle = 'Sales Rep').
"""
# Your code here
sales = """ 
SELECT employeeNumber, firstName, lastName, jobTitle
FROM employees
WHERE jobTitle = "Sales Rep"
"""

pd.read_sql(sales, conn)

    employeeNumber firstName   lastName   jobTitle
0             1165    Leslie   Jennings  Sales Rep
1             1166    Leslie   Thompson  Sales Rep
2             1188     Julie   Firrelli  Sales Rep
3             1216     Steve  Patterson  Sales Rep
4             1286  Foon Yue      Tseng  Sales Rep
5             1323    George     Vanauf  Sales Rep
6             1337      Loui     Bondur  Sales Rep
7             1370    Gerard  Hernandez  Sales Rep
8             1401    Pamela   Castillo  Sales Rep
9             1501     Larry       Bott  Sales Rep
10            1504     Barry      Jones  Sales Rep
11            1611      Andy     Fixter  Sales Rep
12            1612     Peter      Marsh  Sales Rep
13            1619       Tom       King  Sales Rep
14            1621      Mami      Nishi  Sales Rep
15            1625   Yoshimi       Kato  Sales Rep
16            1702    Martin     Gerard  Sales Rep

In [22]:
"""
Question List customer names along with their sales representative’s (employee) full name.
"""

# Your code here
representatives = """ 
SELECT  c.customerName, e.firstName || " " || e.lastName AS salesRep , e.email
FROM customers c
JOIN employees e
ON c.salesRepEmployeeNumber = e.employeeNumber
WHERE e.jobTitle = "Sales Rep"
"""

pd.read_sql(representatives, conn)

,customerName,salesRep,email
0,Corporate Gift Ideas Co.,Leslie Jennings,ljennings@classicmodelcars.com
1,Mini Gifts Distributors Ltd.,Leslie Jennings,ljennings@classicmodelcars.com
2,Mini Wheels Co.,Leslie Jennings,ljennings@classicmodelcars.com
3,Signal Collectibles Ltd.,Leslie Jennings,ljennings@classicmodelcars.com
4,Technics Stores Inc.,Leslie Jennings,ljennings@classicmodelcars.com
...,...,...,...
95,"Corrida Auto Replicas, Ltd",Martin Gerard,mgerard@classicmodelcars.com
96,Enaco Distributors,Martin Gerard,mgerard@classicmodelcars.com
97,"Iberia Gift Imports, Corp.",Martin Gerard,mgerard@classicmodelcars.com
98,Precious Collectables,Martin Gerard,mgerard@classicmodelcars.com
99,"Vida Sport, Ltd",Martin Gerard,mgerard@classicmodelcars.com

In [25]:
"""
Question : Show all employees who are not sales reps (jobTitle != 'Sales Rep')
"""

# Your code here
not_sales = """
SELECT employeeNumber, firstName || " " || lastName  Name, jobTitle
FROM employees
WHERE jobTitle != "Sales Rep"
"""

pd.read_sql(not_sales, conn)

   employeeNumber               Name              jobTitle
0            1002       Diane Murphy             President
1            1056     Mary Patterson              VP Sales
2            1076      Jeff Firrelli          VP Marketing
3            1088  William Patterson  Sales Manager (APAC)
4            1102      Gerard Bondur   Sale Manager (EMEA)
5            1143        Anthony Bow    Sales Manager (NA)

In [ ]:
"""
Question : Find all orders with their product name ,order date, customer name, and status.
"""

orders = """
SELECT p.productName, o.orderDate, c.customerName, o.status
FROM orders o
JOIN customers c
ON o.customerNumber = c.customerNumber
JOIN products p
ON p.productCode = od.productCode
JOIN orderdetails od
ON o.orderNumber = od.orderNumber
GROUP BY o.status
"""
pd.read_sql(orders, conn)

,productName,orderDate,customerName,status
0,1972 Alfa Romeo GTA,2003-10-23,Scandinavian Gift Ideas,Cancelled
1,1993 Mazda RX-7,2005-04-15,Danish Wholesale Imports,Disputed
2,1917 Grand Touring Sedan,2005-05-29,Souveniers And Things Co.,In Process
3,1962 LanciaA Delta 16V,2004-11-19,"Volvo Model Replicas, Co",On Hold
4,1962 LanciaA Delta 16V,2003-10-21,Mini Auto Werke,Resolved
5,1917 Grand Touring Sedan,2003-01-06,Online Diecast Creations Co.,Shipped

In [29]:
""" Question : Show product names and quantities ordered in each order."""

product = """
SELECT p.productName, od.quantityOrdered, od.productCode Code
FROM orderdetails od
JOIN products p
ON od.productCode = p.productCode
GROUP BY od.productCode
ORDER BY od.quantityOrdered DESC
LIMIT 10
"""
pd.read_sql(product, conn)

                              productName  quantityOrdered       Code
0                Corsair F4U ( Bird Cage)               50   S24_3949
1                1940 Ford Delivery Sedan               50   S24_3816
2                      1911 Ford Town Car               50   S18_2248
3                     1972 Alfa Romeo GTA               50   S10_4757
4  1950's Chicago Surface Lines Streetcar               49   S32_3207
5        1936 Mercedes Benz 500k Roadster               49   S24_3969
6                  1900s Vintage Bi-Plane               49   S24_2841
7                        Boeing X-32A JSF               48   S72_1253
8               American Airlines: MD-11S               48  S700_4002
9          1948 Porsche Type 356 Roadster               47   S18_3685

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [33]:
# Your code here
products = """
SELECT p.productName, od.productCode, e.lastName || ' ' || e.firstName EmployeeName, od.quantityOrdered
FROM orderdetails od
JOIN products p ON od.productCode = p.productCode
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
ORDER BY od.quantityOrdered DESC
"""
pd.read_sql(products, conn)

,productName,productCode,EmployeeName,quantityOrdered
0,1969 Dodge Charger,S12_4675,Hernandez Gerard,97
1,1969 Dodge Super Bee,S18_3278,Marsh Peter,90
2,America West Airlines B757-200,S700_2466,Vanauf George,85
3,F/A 18 Hornet 1/72,S700_3167,Vanauf George,77
4,1970 Plymouth Hemi Cuda,S12_3990,Marsh Peter,77
...,...,...,...,...
2991,1961 Chevrolet Impala,S24_4620,Marsh Peter,10
2992,1968 Dodge Charger,S12_3380,Castillo Pamela,10
2993,1913 Ford Model T Speedster,S18_2949,Castillo Pamela,10
2994,1932 Alfa Romeo 8C2300 Spider Sport,S18_4409,Jennings Leslie,6
2995,1932 Model A Ford J-Coupe,S18_2325,Marsh Peter,6

In [45]:
# Your code here
products = """
SELECT  e.lastName || ' ' || e.firstName EmployeeName, od.quantityOrdered, SUM(od.quantityordered * od.priceEach) AS totalPrice
FROM orderdetails od
JOIN products p ON od.productCode = p.productCode
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY EmployeeName 
ORDER BY quantityOrdered DESC
"""
pd.read_sql(products, conn)

        EmployeeName  quantityOrdered  totalPrice
0    Castillo Pamela               50   868220.55
1     Firrelli Julie               49   386663.20
2     Tseng Foon Yue               39   488212.67
3         Bott Larry               37   732096.79
4        Marsh Peter               36   584593.76
5      Gerard Martin               36   387477.47
6   Hernandez Gerard               34  1258577.81
7         Nishi Mami               33   457110.07
8    Jennings Leslie               33  1081530.54
9        Bondur Loui               31   569485.75
10     Vanauf George               30   669377.05
11   Patterson Steve               30   505875.42
12       Fixter Andy               29   562582.59
13       Jones Barry               25   704853.91
14   Thompson Leslie               21   347533.03

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [49]:
# Your code here
products = """
SELECT e.lastName || ' ' || e.firstName EmployeeName,  SUM(od.quantityordered) Quantity
FROM orderdetails od
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.employeeNumber
ORDER BY e.lastName
"""

pd.read_sql(products, conn)

        EmployeeName  Quantity
0        Bondur Loui      6186
1         Bott Larry      8205
2    Castillo Pamela      9290
3     Firrelli Julie      4227
4        Fixter Andy      6246
5      Gerard Martin      4180
6   Hernandez Gerard     14231
7    Jennings Leslie     11854
8        Jones Barry      7486
9        Marsh Peter      6632
10        Nishi Mami      4923
11   Patterson Steve      5561
12   Thompson Leslie      4056
13    Tseng Foon Yue      5016
14     Vanauf George      7423

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [55]:
# Your code here
distinct = """
SELECT COUNT(DISTINCT p.productName) Products, e.lastName || ' ' || e.firstName EmployeeName
FROM orderdetails od
JOIN products p ON od.productCode = p.productCode
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.employeeNumber
HAVING COUNT(DISTINCT p.productName) > 100
"""

pd.read_sql(distinct, conn)

   Products      EmployeeName
0       107   Jennings Leslie
1       101       Bondur Loui
2       109  Hernandez Gerard

In [56]:
# Your code here
distinct = """
SELECT COUNT(DISTINCT p.productName) Products, e.lastName || ' ' || e.firstName EmployeeName
FROM orderdetails od
JOIN products p ON od.productCode = p.productCode
JOIN orders o ON od.orderNumber = o.orderNumber
JOIN customers c ON o.customerNumber = c.customerNumber
JOIN employees e ON c.salesRepEmployeeNumber = e.employeeNumber
GROUP BY e.employeeNumber
ORDER BY Products DESC
"""

pd.read_sql(distinct, conn)

    Products      EmployeeName
0        109  Hernandez Gerard
1        107   Jennings Leslie
2        101       Bondur Loui
3        100   Castillo Pamela
4         98       Jones Barry
5         97       Marsh Peter
6         97        Bott Larry
7         96     Vanauf George
8         95   Patterson Steve
9         82       Fixter Andy
10        81        Nishi Mami
11        80    Firrelli Julie
12        78     Gerard Martin
13        74    Tseng Foon Yue
14        73   Thompson Leslie

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!